                R STATEPFR
     A            STATES        15A         COLHDG('STATE')
     A                                      TEXT('STATE')
     A            CITY          15A         COLHDG('CITY')
     A                                      TEXT('CITY')
     A            PINCODE        6S 0       COLHDG('PIN CODE')
     A                                      TEXT('PIN CODE')
     A          K STATES
