**Free
// ------------------------------------------------------------------------------- //
// Created By..........: Programmers.io @ 2024                                     //
// Created Date........: 2024/07/31                                                //
// Developer...........: Kartik Parihar                                            //
// Description.........: Copybook                                                  //
// ------------------------------------------------------------------------------- //
// MODIFICATION LOG:                                                               //
// ------------------------------------------------------------------------------- //
// Date    | Mod_ID  | Developer  | Case and Description                           //
// --------|---------|------------|----------------------------------------------- //
// 24/07/31|         | Kartik P   | Copybook Creation                              //
// ------------------------------------------------------------------------------- //

Dcl-Pr MngDsbrd;
End-Pr;

Dcl-Pr  CRSubFile;
End-Pr;

